[
	{
		"lang": "ENG",
		"info": [
			{
				"text": [
					"Thanks for trying out this tribute to text adventure games of the past, while ~big boys games~",
					"hopes to acchieve something new in terms of:",
					"",
					"1 - Making players to not give up frustrated in their absolute first move",
					"2 - Focus on playing experience, a mix of text adventure and interactive fiction",
					"3 - Stay in old school environment using ^pure console^ with background images",
					"4 - Using huds, maps, hints, quests and awards to help people keep from going lost"
				]
			},
			{
				"text": [
					"Games from 80's opened the vault of interactivity, but could not compete with even 8 bit era",
					"graphics, because:",
					"",
					"-sentence logic \"use sword on troll\" completely non-intuitive, even for programmers;",
					"-complicated puzzles for the sake of complexity (cruelty);",
					"-required physical notes of locations for players to not get lost;"
				]
			},

			{
				"text": [
					"~Text Adventures (TA) & Interactive Fiction (IF)~",
					"",
					"Pure text games were born in a time when computers did not have the most graphical capabilites.",
					"Just like interactive books, the game makers used text to give the players a fly into their",
					"own imagination while the computer persisted the players decisions."
				]
			},
			{
				"text": [
					"With the decline of TA because of the rise on the game graphics, these text games were introverted",
					"to a more niche location inside the interactive fiction community (derived from books).",
					""
				]
			},

			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"By experience, text adventures are EXTREMELY frustrating to newbies, and by this premisse, the games",
					"in this collection were thought out with these checkpoints in mind:"
				]
			},
			{
				"text": [
					"1. ^(very) limited actions^ >> No crazyness on the input. Inside the scene you can type anything, but is",
					"also expressed objetively as choice (1 - \"do this\", 2 - \"do that\") or just what the /help provide with",
					"the commands available.",
					"",
					"Think of the input blinking cursor as \"homage\", and using the keyboard instead of a mouse."
				]
			},

			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"2. ^please forget about 'advanced' parsing^, and let it stay DEAD.",
					""
				]
			},
			{
				"text": [
					"One \"no boundaries\" interface (even 3+ words) drives people CRAZY (and away to the game) really fucking fast",
					"(\"turn off lamp\", \"rub oil lamp\") -- also complicates matters for everyone: coder and the player."
				]
			},

			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"3. ^hints^ >> Just for people cheat legally in the game -- its counted and persisted on the save game.",
					"If you wanna go hardcore, just dont use it (or use option 4 on difficulty to see the difference)  ;)",
					"",
					"When you are stuck, use ^/hint^."
				]
			},
			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"4. ^awards^ >> To make our player visualize how much he explored the game, and also a place to get a free hint",
					"about what can you do next."
				]
			},

			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"5. ^player hud in the input text^ >> Instead of the standard \"> \", we use the text to also inform the player",
					"what is going on. This will help everyone staying on track for the current objetives."
				]
			},
			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"6. ^quests^ >> A more elaborate way to engage in the game world, with a better reference on ~what~ to do and",
					"the context of the objetive. This is copy and paste from RPGs, and text adventures can benefit enormously."
				]
			},

			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"7. ^game map using text^ >> No more Left, Right, West, East commands... lets provide the player with the",
					"aid of some visualization of space represented in a simple ascii map.",
					"",
					"The main focus of the games is on interactivity and decision making, not memorization and eventually cruelty for",
					"the sake of only being hard. BBG is about ^telling awesome stories within the gameplay^."
				]
			},
			{
				"text": [
					"~The 'big boys games' style of text adventure~",
					"",
					"Maps also unfold themselves, not a big one map. You start in a \"cave\" and you should see probably 3 or 4 maps ", 
					"as you go. Some maps have secrets."
				]
			}


		]
	}
]
