[
	{
		"lang": "ENG",
		"info": [
			{
				"text": [
					"Thanks for trying out this tribute to text adventure games of the past,",
					"while I hope we try something new in terms of:",
					"",
					"1 - Making players to not give up frustrated in their absolute first move",
					"2 - Focus on playing experience, a mix of text adventure (TA) and interactive fiction (IF)",
					"3 - Stay in old school environment *pure console*, using colors and ascii table fx",
					"4 - Use maps, hints, quests and awards to help people keep engaging in the game",
					""
				]
			},
			{
				"text": [
					"~-- Text Adventures (TA) & Interactive Fiction (IF)~",
					"",
					"Pure text games were born in a time when computers did not have most",
					"graphical capabilites. Just like interactive books, the game makers",
					"use text to give the players a fly into their own imagination while",
					"the computer persisted the players decisions.",
					"",
					"With the decline of TA because of the rise on the game graphics, these",
					"type of games were introverted to a more niche location inside the",
					"interactive fiction community (derived from books).",
					""
				]
			},
			{
				"text": [
					"~-- What can be learned from past mistakes?~",
					"",
					"Text adventure games from 80's open the vault of interactivity, but could not compete",
					"with even 8 bit era graphics, because, in my humble opinion:",
					"",
					"-sentence logic \"use sword on troll\" completely non-intuitive",
					"-complicated puzzles for the sake of complexity (cruelty)",
					"-required physical notes of locations for players to not get lost",
					""
				]
			},
			{
				"text": [
					"~--The 'big boys games' style of text adventure~",
					"",
					"By experience, text adventures are EXTREMELY frustrating to newbies, and",
					"by this premisse, the games in this collection were thought out with these",
					"checkpoints in mind:",
					""
				]
			},
			{
				"text": [
					"^1) (very) limited actions:^",
					"",
					"No crazyness on the input. Inside the scene you can type anything, but is",
					"also expressed objetively as choice (1 - \"do this\", 2 - \"do that\") or ",
					"just what the \"/help\" provide as all the commands for the game.",
					""
				]
			},
			{
				"text": [
					"^2) please forget about 'advanced' parsing, and let it stay DEAD:^",
					"",
					"A \"no boundaries\" interface (even 3+ words!) drives people CRAZY (and away to the ",
					"game) really f* fast (\"turn off lamp\", \"rub oil lamp\") -- also complicates ",
					"matters for everyone: coder and the player.",
					""
				]
			},
			{
				"text": [
					"^3) hints:^",
					"",
					"Just for people cheat legally in the game -- its counted and persisted",
					"on the save game. If you wanna go hardcore, just dont use it.  ;)",
					""
				]
			},
			{
				"text": [
					"^4) awards:^",
					"",
					"To make our player visualize how much he explored the game, and can be",
					"a place to get a free hint about what can you do.",
					""
				]
			},
			{
				"text": [
					"^5) quests / logs:^",
					"",
					"Aid the player about what to do next, instead of wondering about.",
					""
				]
			},
			{
				"text": [
					"^6) on-game map:^",
					"",
					"No more Left, Right, West, East commands... lets provide the player with the",
					"aid of some visualization of space represented in a simple ascii map.",
					"",
					"The focus is on interactivity and decision making, NOT F* memorization and",
					"eventually cruelty for the sake of being hard.",
					""
				]
			},
			{
				"text": [
					"^7) on-game map (fog of war):^",
					"",
					"Maps unfold themselves, not a big one map.",
					"",
					"You should see probably 3 or 4 maps as you go inside an area.",
					"Some maps will have secrets.",
					""
				]
			}
		]
	}
]
