[
  {
    "game_name": "Feed Korg",
    "game_tip": [
      "      As a teenager, you went missing in the woods for three days. You came back in the",
      "      middle of the night, dirty and hurt.",
      "",
      "      For the whole of your life, you were a skinny person.",
      "",
      "      Forty years later, now in your fifties, you are a factory worker living in Colorado",
      "      -- one day, going to the grocery store, a terrible accident happens, losing your right",
      "      leg. In the middle of the pool of blood, your missing limb transforms into a little",
      "      demonic entity.",
      "",
      "      The creature said to you: \"You must... feed... Korg!\""
    ]
  },
  {
    "game_name": "Hellfire Club",
    "game_tip": [
      "      Deep in hell, there is a club for tormented spirits.",
      "",
      "      Select your soul to enter this alternate reality, and in there, unravel all it's",
      "      unique secrets and strange lost creatures.",
      "",
      "      With a ticket to enter this club, you realize that everytime you die in this place,",
      "      you will keep coming back, like a curse. ",
      "",
      "      Until the contract from Hellfire is lifted, guide your spirit to the light, understanding",
      "      all the work needed to cleanse your soul from your previous life trauma by winning the",
      "      challenges from the demon world."
    ]
  },
  {
    "game_name": "NightCrawlers",
    "game_tip": [
      "      After losing your mother in a terrible and devastating cancer, you felt your life is",
      "      completely lost of meaning, and you shutdown yourself to others; thus you become a ",
      "      Hikimori (a modern hermit).",
      "",
      "      You now have 32 years old and live in Tokyo, Japan. Your military father tries to bring",
      "      you back into reality, with no success. Food arrives at your door from a maid, and you ",
      "      forcibly take a bath once a week in order to have something to eat.",
      "",
      "      One day you fall ill, stay between life and death for almost a week inside your rooom. ",
      "      As you got a little better, you see that there is no more food at your door. You receive",
      "      a strange email from your father, asking you to wait for him at the helicopter pod at the",
      "      the nearby comercial building to escape \"the invasion\".",
      "",
      "      When you open the door, you see a alien ball of fur and teeth eating your maid corpse.",
    ]
  },
  {
    "game_name": "Paranormal investigator",
    "game_tip": [
      "      Early on, you discovered that ghost are real. Your grandfather stayed with you for five",
      "      years, telling you everything about the post-life underworld. It was scary, but eventually",
      "      you became more seasoned to the strange and the otherworldly.",
      "",
      "      As people come for you in need of help, you solve their problems by feeling the psychic",
      "      connection between them, all the trauma and the strange energy creatures that cause mayhem",
      "      crossing overto the human realm.",
      "",
      "      By opening a private detective office, now you must confront your fears and maintain the rest",
      "      of your failing sanity for your next paycheck."
    ]
  }
]
